wiki/2017-03-03-git-quick-help.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>QUICK HELP OF GIT</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">QUICK HELP OF GIT</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#git"><div class="category">git</div></a> </div>
<div class="char-counter">2017-03-03</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaf41c09">创建</a></li>
<li><a href="#orge384b0a">提交</a></li>
<li><a href="#orgbc92c70">状态</a></li>
<li><a href="#org65f0e39">时光穿梭</a></li>
<li><a href="#org4dfc18c">远程库</a></li>
<li><a href="#org99f291f">分支管理</a></li>
<li><a href="#org8947c5c">标签管理</a></li>
<li><a href="#org6094bc8">自定义Git</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgaf41c09" class="outline-2">
<h2 id="orgaf41c09">创建</h2>
<div class="outline-text-2" id="text-orgaf41c09">
<pre class="example">
git init [dir]
git init --bare [dir]

</pre>
</div>
</div>

<div id="outline-container-orge384b0a" class="outline-2">
<h2 id="orge384b0a">提交</h2>
<div class="outline-text-2" id="text-orge384b0a">
<pre class="example">
git add &lt;files&gt;
git commit -m "comment"
git commit -a -m "comment"

</pre>
</div>
</div>

<div id="outline-container-orgbc92c70" class="outline-2">
<h2 id="orgbc92c70">状态</h2>
<div class="outline-text-2" id="text-orgbc92c70">
<p>
要随时掌握工作区的状态，使用 <i>git status</i> 命令。如果 <i>git status</i> 告诉你有文件被修改
过，用 <i>git diff</i> 可以查看修改内容。
</p>
</div>
</div>

<div id="outline-container-org65f0e39" class="outline-2">
<h2 id="org65f0e39">时光穿梭</h2>
<div class="outline-text-2" id="text-org65f0e39">
<p>
首先，Git 必须知道当前版本是哪个版本，在 Git 中，用 HEAD 表示当前版本，上一个版
本就是 HEAD^，上上一个版本就是 HEAD^^，当然往上 100 个版本写 100 个 ^ 比较容易数
不过来，所以写成 HEAD~100。HEAD 指向的版本就是当前版本，因此，Git 允许我们在版本
的历史之间穿梭，使用命令 <code>git reset --hard commit_id/ 穿梭前，用 /git log</code> 可以查看
提交历史，以便确定要回退到哪个版本。要重返未来，用 <code>git reflog</code> 查看命令历史，以便确
定要回到未来的哪个版本。
</p>
<ol class="org-ol">
<li>撤销修改
<ul class="org-ul">
<li>场景1：当你改乱了工作区某个文件的内容，想直接丢弃工作区的修改时，
用命令 <code>git checkout -- file</code></li>
<li>场景2：当你不但改乱了工作区某个文件的内容，还添加到了暂存区时，想丢弃修改，
分两步，第一步用命令 <code>git reset HEAD file</code> ，就回到了场景1，第二步按场景1操作。</li>
<li>场景3：已经提交了不合适的修改到版本库时，想要撤销本次提交，参考时光穿梭一节，
不过前提是没有推送到远程库。</li>
</ul></li>

<li><p>
删除文件
</p>

<p>
命令 <code>git rm</code> 用于删除一个文件。如果一个文件已经被提交到版本库，那么你永远不用
担心误删，但是要小心，你只能恢复文件到最新版本，你会丢失最近一次提交后你修改
的内容。
</p></li>
</ol>
</div>
</div>

<div id="outline-container-org4dfc18c" class="outline-2">
<h2 id="org4dfc18c">远程库</h2>
<div class="outline-text-2" id="text-org4dfc18c">
<ol class="org-ol">
<li><p>
添加远程库
要关联一个远程库，使用命令
</p>
<pre class="example">
git remote add origin git@server-name:path/repo-name.git

</pre>
<p>
关联后，使用命令
</p>
<pre class="example">
git push -u origin master

</pre>
<p>
第一次推送master分支的所有内容；此后，每次本地提交后，只要有必要，
就可以使用命令
</p>
<pre class="example">
git push origin master

</pre>
<p>
推送最新修改；
</p>

<p>
分布式版本系统的最大好处之一是在本地工作完全不需要考虑远程库的存在，也就是有
没有联网都可以正常工作，而SVN在没有联网的时候是拒绝干活的！当有网络的时候，再
把本地提交推送一下就完成了同步，真是太方便了！
</p></li>

<li><p>
克隆仓库
</p>

<p>
要克隆一个仓库，首先必须知道仓库的地址，然后使用 <code>git clone</code> 命令克隆。Git 支持
多种协议，包括 https，但通过 ssh 支持的原生 git 协议速度最快。
</p></li>
</ol>
</div>
</div>


<div id="outline-container-org99f291f" class="outline-2">
<h2 id="org99f291f">分支管理</h2>
<div class="outline-text-2" id="text-org99f291f">
<ol class="org-ol">
<li>创建与合并分支
Git鼓励大量使用分支：
<ul class="org-ul">
<li>查看分支： <code>git branch</code></li>
<li>创建分支： <code>git branch &lt;name&gt;</code></li>
<li>切换分支： <code>git checkout &lt;name&gt;</code></li>
<li>创建+切换分支： <code>git checkout -b &lt;name&gt;</code></li>
<li>合并某分支到当前分支： <code>git merge &lt;name&gt;</code></li>
<li>删除分支： <code>git branch -d &lt;name&gt;</code></li>
</ul></li>

<li><p>
解决冲突
</p>

<p>
当Git无法自动合并分支时，就必须首先解决冲突。解决冲突后，再提交，合并完成。用
git log –graph命令可以看到分支合并图。
</p>
<pre class="example">
git log --graph --pretty=oneline --abbrev-commit

</pre></li>

<li><p>
分支管理策略
</p>

<p>
Git分支十分强大，在团队开发中应该充分应用。合并分支时，加上 <code>–no-ff</code> 参数就可以用
普通模式合并，合并后的历史有分支，能看出来曾经做过合并，而 <code>fast forward</code> 合并就
看不出来曾经做过合并。
</p></li>

<li><p>
Bug分支
</p>

<p>
修复bug时，我们会通过创建新的bug分支进行修复，然后合并，最后删除；当手头工作
没有完成时，先把工作现场git stash一下，然后去修复bug，修复后，再git stash pop，
回到工作现场。
</p>
<pre class="example">
git stash
git stash list

</pre>
<ul class="org-ul">
<li>一是用 <code>git stash apply</code> 恢复，但是恢复后，stash 内容并不删除，你需要用
<code>git stash drop</code> 来删除；</li>
<li>另一种方式是用 <code>git stash pop</code> ，恢复的同时把stash内容也删了：</li>
</ul></li>

<li><p>
Feature分支
</p>

<p>
添加一个新功能时，你肯定不希望因为一些实验性质的代码，把主分支搞乱了，所以，
每添加一个新功能，最好新建一个 feature 分支，在上面开发，完成后，合并，最后，
删除该 feature 分支。开发一个新 feature，最好新建一个分支；如果要丢弃一个没有
被合并过的分支，可以通过 =git branch -D &lt;name&gt; = 强行删除。
</p></li>

<li><p>
多人协作
</p>

<p>
查看远程库信息，使用 <code>git remote -v</code> ；
</p>

<p>
本地新建的分支如果不推送到远程，对其他人就是不可见的；
</p>

<p>
从本地推送分支，使用 <code>git push origin branch-name</code> ，
</p>

<p>
如果推送失败，先用 <code>git pull</code> 抓取远程的新提交；
在本地创建和远程分支对应的分支，使用 <code>git checkout -b branch-name origin/branch-name</code> ，
本地和远程分支的名称最好一致；
建立本地分支和远程分支的关联，使用 <code>git branch --set-upstream branch-name origin/branch-name</code> ；
从远程抓取分支，使用 <code>git pull</code> ，如果有冲突，要先处理冲突。
</p></li>
</ol>
</div>
</div>


<div id="outline-container-org8947c5c" class="outline-2">
<h2 id="org8947c5c">标签管理</h2>
<div class="outline-text-2" id="text-org8947c5c">
<ol class="org-ol">
<li>创建标签
<ul class="org-ul">
<li>命令  <code>git tag &lt;name&gt;</code> 用于新建一个标签，默认为HEAD，也可以指定一个commit id；</li>
<li>命令 <code>git tag -a &lt;tagname&gt; -m "blablabla…"</code> 可以指定标签信息；</li>
<li>命令  <code>git tag -s &lt;tagname&gt; -m "blablabla…"</code> 可以用PGP签名标签；</li>
<li>命令 <code>git tag</code> 可以查看所有标签。</li>
</ul></li>

<li>操作标签
<ul class="org-ul">
<li>命令 <code>git push origin &lt;tagname&gt;</code> 可以推送一个本地标签；</li>
<li>命令 <code>git push origin --tags</code> 可以推送全部未推送过的本地标签；</li>
<li>命令 <code>git tag -d &lt;tagname&gt;</code> 可以删除一个本地标签；</li>
<li>命令 <code>git push origin :refs/tags/&lt;tagname&gt;</code> 可以删除一个远程标签。</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org6094bc8" class="outline-2">
<h2 id="org6094bc8">自定义Git</h2>
<div class="outline-text-2" id="text-org6094bc8">
<ol class="org-ol">
<li>忽略特殊文件
忽略某些文件时，需要编写.gitignore；
.gitignore文件本身要放到版本库里，并且可以对.gitignore做版本管理！</li>

<li>配置别名
<ul class="org-ul">
<li><code>git config –global alias.st status</code></li>
<li><code>git config –global alias.co checkout</code></li>
<li><code>git config –global alias.ci commit</code></li>
<li><code>git config –global alias.br branch</code></li>
<li><code>git config –global alias.unstage 'reset HEAD'</code></li>
<li><code>git config –global alias.last 'log -1'</code></li>
<li><code>git config –global alias.lg "log –color –graph –pretty=format:'%Cred%h%Creset -%C(yellow)%d%Creset %s %Cgreen(%cr) %C(bold blue)&lt;%an&gt;%Creset' –abbrev-commit"</code></li>
</ul></li>

<li><p>
配置文件
配置 Git 的时候，加上 <code>–global</code> 是针对当前用户起作用的，
如果不加，那只针对当前的仓库起作用。
配置文件放哪了？每个仓库的Git配置文件都放在.git/config文件中：
</p>
<pre class="example">
$ cat .git/config

</pre>
<p>
别名就在[alias]后面，要删除别名，直接把对应的行删掉即可。
而当前用户的Git配置文件放在用户主目录下的一个隐藏文件.gitconfig中：
</p>
<pre class="example">
$ cat .gitconfig

</pre>
<p>
配置别名也可以直接修改这个文件，如果改错了，可以删掉文件重新通过命令配置。
</p></li>
</ol>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
